app/controllers/movies_controller.rb

  def index
    # form_tag workarounds
    params[:utf8] = nil
    params[:commit] = nil

    if params[:orderBy]=="movie"
       session[:orderBy] = "movie"
    elsif params[:orderBy]=="release_date"
       session[:orderBy] = "release_date"
    end

    if session[:orderBy]=="movie"
       @movies = Movie.find(:all, :order=>"title ASC")
       @highlighted="movie"
    elsif session[:orderBy]=="release_date"
       @movies = Movie.find(:all, :order=>"release_date ASC")
       @highlighted="date"
    else
       @movies = Movie.all
---
SELECT "movies".* FROM "movies" ORDER BY release_date ASC